Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: For instance, if you are just starting to develop a product or deliver a service that includes open source and you do not yet have any compliance infrastructure in place, the most immediate concern should be establishing a compliance team, processes and policy, tools and automation, and training your employees.
ja: たとえば、もしオープンソースを含む製品開発やサービス提供を始めたばかりであり、すでに動いているコンプライアンスのインフラストラクチャーが何もないならば、最も差し迫った懸念はコンプライアンス チームを作ることであり、プロセスとポリシー、ツールと自動化を確立することであり、従業員を訓練することです。

source: For instance, when a new software release becomes available, the updated release must include an update license information file to reflect any open source changes introduced in the new release.
ja: 例えば、新しいソフトウェア リリースが入手可能になった時、アップデートされたリリースは、新しいリリースで導入されたオープン ソースの全ての変更を反映している、アップデートされたライセンス情報ファイルを含んでいなければなりません。

source: For most software components, approval is granted by the OSRB once a ticket has progressed to that point in the compliance process.
ja: ほとんどのソフトウェア コンポーネントに対して、チケットがコンプライアンス プロセスのこの点まで進めば、承認が与えられます。

source: For product updates such as over-the-air (OTA) updates for cell phones, the attributions must also be revised when the product update includes new or updated open source components.
ja: 携帯電話での通信での（OTA）製品アップデートに関していうと、製品アップデートが新しいあるいは更新されたオープン ソース コンポーネントを含むのであれば、帰属は、更新されなければなりません。

source: For product updates, license information must also be updated.
ja: 製品アップデートに関して、ライセンス情報もまたアップデートされなければなりません。

source: For products updates, the copyright information must also be updated.
ja: 製品アップデートに関して、著作権情報もまたアップデートされなければなりません。

source: For products with a user accessible file system, it is recommended that the license is included in the file system with a filename LICENSE to make it stand out and to be similar to the open source license filename.
ja: ユーザーがアクセス可能なファイルシステムを有する製品では、ライセンスは、意味が分かるようするために、また、オープン ソースのライセンスファイル名と同じようにするために、LICENSEというファイル名でファイルシステムに含まれていることを推奨します。

source: For the acquiring company, comprehensive code evaluation assures accurate valuation of software assets and mitigates the risk of unanticipated licensing issues undermining future value.
ja: 買収側の企業にとって、包括的なコードの評価はソフトウェア資産を正確に評価し、将来の企業価値が予期せぬライセンス問題にさらされるリスクを緩和することに繋がります。

source: For the purpose of this book, the focus of the discussion is using and integrating open source with proprietary and third-party source code in a commercial product.
ja: 本書の目的から、ここでの議論の焦点は、商用製品におけるオープン ソースとプロプライエタリやサード パーティ ソースコードとの統合や利用に当てます。

source: Foreword
ja: 序文（Foreword）

source: Formal Training
ja: 公式トレーニング

source: Formal Training 128
ja: 公式トレーニング 128

source: Formal methods include instructor-led training courses where employees have to pass a knowledge exam to pass the course.
ja: 公式の方法は、修了するために従業員は試験に合格する必要がある、インストラクターが担当するトレーニングコースを含みます。

source: Formal training mandated for all employees working with open source software .
ja: オープンソース ソフトウェア関連業務に携わる全従業員に対する正式な訓練命令

source: Full License Text
ja: ライセンス全文

source: Furthermore, a recommended practice is to provide email and postal mail contact information for any compliance or open source-related questions.
ja: 更に、推奨プラクティスでは、コンプライアンスやオープン ソースに関係する問い合わせの受付に関する、電子メールや住所などの情報を提供します。

source: Furthermore, development teams may have made modifications to open source components, triggering the need for additional due diligence and potential additional obligations.
ja: 更に、開発チームは、オープン ソース コンポーネントに変更を入れているかもしれませんが、これは、追加の精査を必要とするかもしれませんし、潜在的に追加義務を負うかもしれません。

source: Furthermore, it ensures that the company has a plan to fulfill the license obligations resulting from using the various software components prior to customer receipt.
ja: さらに、それは、顧客が製品を受け取る前に、様々なソフトウェア コンポーネント利用に起因するライセンス義務を実行する計画を、企業が持つことを確実にします。

source: Furthermore, it makes it easy to create an association between a license and what needs to be done.
ja: 更に、ライセンスとなすべき行動との関連付けを簡単に作成することができます。

source: Furthermore, open source license interpretations and legal risks continue to evolve.
ja: 更に、オープンソースラインセンスの解釈や法的リスクも進化します。

source: Furthermore, the companies whose compliance has been successfully challenged have incurred costs that included:
ja: 更に、コンプライアンス異議申し立てを受け、それが成功すると下記のコストを負うことになりました。

source: Furthermore, there is the added advantage of verifiable compliance in dealing with OEMs and downstream vendors.
ja: 更には、OEMや下流のベンダーとの取引においてコンプライアンスが検証できることは付加的な優位となります。

source: GENERAL GUIDELINES
ja: 一般的なガイドライン

source: GENERAL GUIDELINES 135
ja: 一般的なガイドライン 135

source: General Considerations
ja: 一般的な考察

source: General Considerations 124
ja: 一般的な考察 124

source: General Services Administration (U.S.
ja: 米国連邦調達庁

source: Generally speaking, companies want to ensure that any source code subject to open source distribution obligations is compliance-ready prior to product shipment.
ja: 一般的に言って、企業は、製品出荷前にオープン ソース頒布に関する義務を果たした状態にできることを望みます。

source: Get my manager’s approval
ja: マネージャの承認をもらう

source: Given the BOM for product v1.1 and the BOM for v1.0, we compute the delta, and the output of the tool is the following:
ja: 製品V1.1のBOMと製品V1.0のBOMがあると、その差分を計算します。ツールの出力は以下のようなものです。

source: Good audit practices ensure a thorough understanding of the provenance of all software that will be deployed as part of a product or service.
ja: 良い監査プラクティスは、製品やサービスの一部として採用される全てのソフトウェアの由来を完全に把握することを確実にします。

source: Haddad graduated with Honors from Concordia University (Montreal, Canada) with a Ph.D. in Computer Science.
ja: ハダッドは、優秀な成績で計算機科学の博士号をConcordia University (Montreal, Canada)から授与されました。

source: Haddad is fluent in Arabic, English, and French.
ja: ハダッドは、アラビア語、英語、フランス語が堪能です。

source: Haddad’s career started at Ericsson Research where he spent five years focusing on advanced research for system architecture of wireless IP networks and on furthering the adoption of Linux and Open source software in carrier grade environments.
ja: ハダッドは、キャリアをEricsson Researchで始めました。そこで彼は、5年間ワイヤレスIPネットワークに関する先端研究と、通信業品質環境へのLinuxとオープン ソース ソフトウェアの導入に携わりました。

source: Handle compliance inquiries: The OSRB is responsible for answering any inquiries sent to the company in relation to open source compliance.
ja: コンプライアンスの質問を取扱う。OSRBは企業に送付されたオープンソースのコンプライアンスに関わるあらゆる質問に答える責任があります。

source: Handle inquiries sent to the company in relation to open source compliance.
ja: オープンソースのコンプライアンスに関連して企業に送付された質問を取り扱う

source: Having Legal Counsel provide this education in a very practical way is extremely helpful, as it allows software developers to have access to documented practical advice that will help answer most of their daily legal-related questions.
ja: 法務担当が実際的な方法で教育を実施するようにすることは、とても役に立ちます。ソフトウェア開発者が、法務に関連する日々の質問に答えてくれる文書化された実際的なアドバイスに、アクセスできるからです。

source: Having a community-facing site is particularly important when responding to compliance inquiries.
ja: コミュニティとの接点となるサイトを持つことは、コンプライアンスに関する照会に応答する時に特に重要になります。

source: Having kicked off these activities (in that order) and possessing a good grip on the build system (from a compliance perspective), you can move on to other program elements.
ja: これらの活動を（この順番で）開始し、システム構築を（コンプライアンスの観点から）適切に制御しつつ開始したならば、プログラムの他の要素に進むことができます。

source: He completed his B.Sc.
ja: 彼は、学士と

source: He is a Contributing Editor to the Linux Journal, Co-Author of two books on Red Hat Linux and Fedora, and Technical Editor for four books on Linux System Administration, Fedora Linux and Ubuntu Linux.
ja: 彼は、Linux Journalの寄稿編集者の一人で、Red Hat LinuxとFedoraに関する2つの本の共著者であり、Linux System Administration、Fedora Linux、Ubuntu Linuxに関する4つの本の技術監修者です。

source: He is known for his writing and speaking on topics ranging from open source legal compliance to using open source as a business strategy and an R&D tool to drive collaboration and innovation.
ja: 彼は、オープン ソース法務コンプライアンスから、ビジネス戦略や共同開発やイノベーションを推進するR&Dツールとしてのオープン ソース利用に至る話題についての著書と講演で知られています。

source: He is responsible for overseeing Samsung’s Open source strategy and execution, internal and external collaborative R&D projects, participation in key open source development projects, and representing Samsung in various open source foundations and open standards organizations.
ja: 彼は、Samsungのオープン ソース戦略立案と実行、社内外との共同R&Dプロジェクト、重要オープン ソース開発プロジェクトへの参画に責任を持っており、様々なオープン ソース財団とオープン標準組織でSamsungの代表を務めています。

source: He later supported Hewlett Packard in a consulting role with open sourcing webOS to become the open webOS project.
ja: 後に彼は、webOSをオープン ソース化したopen webOSプロジェクトで、コンサルティングとして、Hewlett Packardを支援しました。

source: He then joined Motorola as Technical Director managing the Open Source Technology Group and contributing to Motorola’s Open source initiatives.
ja: その後、彼はMotorolaにオープン ソース技術グループの技術担当役員として加わり、Motorolaのオープン ソースでのイニシアティブに貢献しました。

source: Help employees understand how to work with open source in a responsible way
ja: 従業員が、責任ある方法でオープン ソースとどのように取り組めばよいか理解するのを助けます。

source: Help employees understand how to work with open source in a responsible way .
ja: 従業員が、責任ある方法でオープン ソースとどのように取り組めばよいか理解するのを助けます。

source: Help manage acquisition of open source components .
ja: オープン ソース コンポーネント入手の管理を助けます。

source: Here are a few.
ja: ここにいくつか挙げます。

source: Historical perspective on open source .
ja: オープンソースについての歴史的な視点

source: Host and maintain the company’s open source websites: The internal website, intended for employees, focuses on open source processes and policies, guidelines, training, and announcements.
ja: 企業のオープンソースのウェブサイトをホストし維持。：従業員向けの内部のウェブサイトはオープンソースのプロセスやポリシー 、ガイドライン、訓練、告知が主となります。

source: How Discovered
ja: 発見する方法

source: How can classifying licenses be helpful?
ja: ライセンス分類はいかに役に立つか？

source: How to Avoid
ja: 回避方法

source: However, generally speaking, it is not regarded as a preferred method of distribution, due to the overhead it poses in verifying the eligibility of the people asking to access the source code and the resources required to fulfill the requests.
ja: しかしながら、一般的に言って、ソース コードへのアクセスを要求してくる人たちの入手資格を確認するのにかかるオーバーヘッドや、要求を満たすために必要となる資源を考えると、好ましい頒布方法とは言えません。

source: However, legal counsel plays an indispensable role in supporting the open source compliance programs and core teams that most organizations create to ensure proper compliance.
ja: しかしながら、法務担当は、オープン ソース コンプライアンス プログラムや適切なコンプライアンスを確実にするもっとも重要なコアチームをサポートする不可欠な役割を果たします。

source: However, source code licensed under License-A cannot statically link to source code licensed under License-B.
ja: しかしながら、ライセンスAで許諾されたソース コードは、ライセンスBで許諾されたソース コードに静的にリンクすることはできません。

source: However, source code licensed under License-C cannot dynamically link to source code licensed under License-B.
ja: しかしながら、ライセンスCで許諾されたソース コードは、ライセンスBで許諾されたソース コードと動的にリンクすることはできません。

source: However, there are important responsibilities accompanying the benefits of teaming with the open source community: Companies must ensure compliance to the obligations that accompany open source licenses.
ja: しかしながら、オープンソースのコミュニティと組むには責任が伴います。オープンソースのライセンスに伴う義務を順守することを保証しなければなりません。

source: However, unlike the core team (in substantial organizations), members of the extended team are working on compliance only on a part- time basis, based on tasks they receive from the OSRB.
ja: ただし拡大チームのメンバは（実体をもつ組織である）コアチームと違い、OSRBから仕事を委任された時だけ活動します。

source: However, unlike the core team (in substantial organizations), members of the extended team are working on compliance only on a part-time basis, based on tasks they receive from the OSRB.
ja: ただし拡大チームのメンバは（実体をもつ組織である）コアチームと違い、OSRBから仕事を委任された時だけ活動します。

source: However, unlike the core team, members of the extended team are only working on compliance on a part-time basis, based on tasks they receive from the OSRB.
ja: ただし拡大チームのメンバはコアチームと違い、OSRBから仕事を委任された時だけ活動します。コンプライアンスに常時携わるわけではないです。

source: However, when you try to compile the package on another system, the compilation settings, makefile options, include paths, etc. may break.
ja: しかしながら、別のシステムでパッケージをコンパイルしようとする場合には、コンパイラの設定や、Makefileのオプションや、Include path等が適切でないかもしれません。

source: However, you may consider releasing your modifications and possibly upstreaming them to reduce your technical debt, or, in other words, the cost of maintaining those modifications.
ja: しかしながら、技術的な負荷、言い換えればこれらの修正を保守するコストを抑えるために、修正をリリースし、可能なアップストリームに載せます。

source: I hope you find it useful in your day-to-day drive to achieve open source compliance.
ja: 皆さんがオープン ソース コンプライアンスを実現するべく、日々の推進活動で本書が役立ってくれることを願ってやみません。

source: INCREMENTAL COMPLIANCE PROCESS
ja: インクリメンタル コンプライアンス プロセス

source: INCREMENTAL COMPLIANCE PROCESS 93
ja: インクリメンタル コンプライアンス プロセス 93

source: INTEGRATE COMPLIANCE IN THE DEVELOPMENT PROCESS
ja: コンプライアンスを開発プロセスに統合

source: INTRODUCTION TO OPEN SOURCE COMPLIANCE
ja: オープン ソース コンプライアンス導入

source: IT provides support and maintenance for the tools and automation infrastructure employed by a compliance program.
ja: IT部門はコンプライアンス プログラムで使われるツールのサポートや、自動化の基盤を提供、維持します。

source: Ibrahim Haddad (Ph.D.) is Vice President of R&D, and the Head of the Open Source Group at Samsung Research America, a wholly owned R&D subsidiary of Samsung Electronics Co. Ltd., South Korea.
ja: イブラヒム ハダッド（Ph.D.） は、Samsung Electronics Co. Ltd.（韓国）のR&Dに関する100%子会社であるSamsung Research AmericaのR&D担当副社長で、オープン ソース グループ長です。

source: Ideally, the compliance officer must possess as many as possible of the following:
ja: 理想としてはコンプライアンス オフィサーは下記を出来る限り備えている必要があります。

source: Ideally, with every development milestone, you can incorporate a corresponding compliance milestone, ensuring that all software components used in the build have parallel and approved compliance tickets.
ja: 理想的にはすべての開発上のマイルストーンにおいて対応するコンプライアンス上のマイルストーンを組み込み、ビルドに使われる全ソフトウェア コンポーネントが対応する、承認されたコンプライアンス チケットを確実に持つようにします。

source: Ideally, you should not rely on engineers to remember if they made code changes (let alone document them).
ja: 理想的には、コード変更をしたかどうか、（ドキュメントはいうに及ばず、）技術者の記録に依存するべきではありません。

source: Identification Phase
ja: 特定フェーズ

source: Identification Phase In the identification phase of a compliance process, organizations identify all of the components or elements entering the build system, origin, and license information.
ja: 特定フェーズ コンプライアンス プロセスの特定フェーズでは、組織は、ビルド システムへ入る全てのコンポーネント、その由来、ライセンス情報を特定します。

source: Identification Phase 109
ja: 特定フェーズ 109

source: Identification and Resolution
ja: 特定と解決

source: Identification and Resolution 81
ja: 特定と解決 81

source: Identification and Resolution Phase
ja: 特定と解決フェーズ

source: Identification and Resolution Phase 85
ja: 特定と解決フェーズ 85

source: Identification of Open Source
ja: オープン ソースの特定

source: Identification of Open Source The goal of this initial step is to monitor the ingress and incorporation of open source in a software portfolio, either as a standalone package or embedded within third-party or company-developed software.
ja: オープン ソースの特定 この最初のステップの目的は、標準パッケージや、サード パーティか自社開発ソフトウェアに組み込まれた形で、オープン ソースがソフトウェア ポートフォリオに入り込んだり統合されたりすることを監視することです。

source: Identification of Open Source 65
ja: オープン ソースの特定 65

source: Identification of incoming source code
ja: 入るソース コードの特定

source: Identification phase outcome
ja: 特定フェーズの結果

source: Identification phase outcome .
ja: 特定フェーズの結果

source: Identification phase prerequisite
ja: 特定フェーズの前提条件

source: Identified files
ja: 特定されたファイル

source: Identified files .
ja: 特定されたファイル

source: Identify all open source used in products, presented in services, and/or used internally
ja: 製品の中で、サービスが開示している、あるいは内部で利用されている全てのオープンソースを識別

source: Identify all open source used in products, presented in services, and/or used internally .
ja: 製品の中で、サービスが開示している、あるいは内部で利用されている全てのオープンソースを識別

source: Identify licenses for binaries and libraries
ja: バイナリとライブラリのライセンスを特定します。

source: Identify linking among binaries and libraries
ja: バイナリとライブラリ間のリンクを特定します。

source: Identify linking among binaries and libraries .
ja: バイナリとライブラリ間のリンクを特定します。

source: Identify modifications to open source.
ja: オープン ソースに施された変更を特定します。

source: If OS component is found in the build system without a corresponding compliance ticket, a new ticket is auto-generated.
ja: もしビルドされたシステムに該当するコンプライアンス チケットがないオープンソース コンポーネントが検出されたら、自動で新チケットを発行

source: If a company fails to establish baseline compliance, it is almost guaranteed that future revisions of the same product (or other products built using the initial baseline) will suffer from compliance issues.
ja: もし企業がコンプライアンスの起点構築に失敗すると、その製品の将来の改訂版（またはおなじ起点を使った異なる製品）がコンプライアンス問題で苦しむことはほぼ確定となります。

source: If a company is considering a merger or is the target of an acquisition, it should structure its compliance program to offer a level of disclosure and provide representations.
ja: 他社との合併や、自社が買収されることを考えるならば、コンプライアンス プログラムはしかるべきレベルの開示を行い、説明が出来るように作られるべきです。

source: If a licensing issue is found, for example mixed source code with incompatible licenses, the legal counsel will flag these issues and reassign the compliance ticket to Engineering to rework the code.
ja: 例えば両立しないライセンスをもつソース コードを組み合わせるなど、ライセンスに課題が発見されたときには、法務担当はこれらの課題にフラグをつけて、コードの再作業のためにコンプライアンス チケットを技術担当へ再割り当てします。

source: If a linkage issue is found, a bug ticket is assigned to Engineering with a description of the issue in addition to a proposal on how to solve the issue.
ja: もしリンクが発見されたら、製造部門に対しバグチケットを発行し、問題と解決方法を記述します。

source: If a new component was submitted that does not correspond to an existing usage (open source request) form, then it is a new component and requires that a new form be filled out.
ja: 既存の利用（オープン ソース要求）フォームに対応しない新しいコンポーネントが提出されたら、それは新しいコンポーネントであり、新しいフォームに記入する必要があります。

source: If a new version of this open source software becomes available, you require a new approval to ensure that the usage model and even the license are still in line with your internal policy.
ja: このオープン ソース ソフトウェアの新しいバージョンが入手可能になったら、利用形態とライセンスが内部ポリシーと整合していることを確認するために新しい承認依頼を出します。

source: If a third-party software provider uses open source, the product team integrating that code into the product must submit an OSRB usage form describing the open source to be used.
ja: もし、サード パーティ ソフトウェア プロバイダーがオープン ソース コードを使っていれば、そのコードを製品に統合する製品チームは、OSRB利用フォームに、利用するオープン ソースを記載して提出しなければなりません。

source: If an approved open source package is no longer in use, engineers must inform the OSRB to update the open source inventory; alternatively, the OSRB will discover that the package is not used anymore when they run the BOM diff tool.
ja: 承認済みのオープン ソース パッケージが利用されなくなったならば、技術者はOSRBに連絡してオープン ソースリストを更新するように通知しなければなりません。さもなければ、OSRBが、BOM差分ツールを実行する際にもはや使われなくなっているパッケージを見つけるでしょう。

source: If an approved package went through a major change, inform the OSRB to re-scan the source code; alternatively, the OSRB will discover that the package has been modified when they run the BOM diff tool.
ja: 承認済みのパッケージが大きな変更を受けた時には、OSRBにソースコードを再スキャンするように通知します。さもなければ、OSRBがBOM差分ツールを実行する際にパッケージが変更されていることを発見するでしょう。

source: If an inquiry is missing information, request additional clarification, such as:
ja: 照会が情報を欠いている時には、追加で次のような確認を要求します。

source: If companies are non-compliant with open source license obligations, they are not licensed, and thus exposed to legal action by the copyright holder for copyright infringement, and can potentially lose the right to use and distribute the software in question.
ja: オープン ソース ライセンス義務を順守しない企業は、ライセンスを取得できず、著作権を侵害したとして、著作権所有者に法的行動をさらされる可能性があります。また、対象となるソフトウェアを使用および配布する権利を失う可能性があります。

source: If nothing has changed in its status .
ja: もし、状況に何も変更が無いならば、

source: If products or services possess a graphical user interface or a command line administrative interface, you can also provide the option to display the attributions via that UI.
ja: もし、製品やサービスがグラフィカル ユーザー インターフェイスやコマンド ライン インターフェイスを持っているならば、帰属をそのUI経由で表示することも選択肢の一つです。

source: If the OSRB rejects the use of the open source component, they communicate the reason for rejection to the requester, and this information is recorded as part of the compliance ticket.
ja: OSRBがオープン ソース コンポーネントの利用を却下する場合、OSRBは却下の理由を要求者に伝え、この情報はコンプライアンス チケットの一部として記録されます。

source: If the compliance inquiry was a false alarm, you can close the compliance inquiry ticket without any further action (other than informing the inquirer of that resolution).
ja: コンプライアンスに関する照会が誤った警告であった場合には、（照会者に結論を伝える以外には）特に何もしないでコンプライアンス チケットをクローズすることができます。

source: If the compliance officer discovers any issues, such as a proprietary software component linking to a GPL licensed component, the compliance officer forwards the compliance ticket to Engineering for resolution.
ja: コンプライアンス オフィサーは、例えば、プロプライエタリ ソフトウェア コンポーネントとGPLで許諾されたコンポーネントがリンクされるような課題を見つけたら、解決のためにコンプライアンス チケットを技術担当へ送ります。

source: If the investigation uncovers an actual compliance issue, you should report back to the inquirer confirming that fact, with assurances that your organization will take all the necessary steps to bring your product or service back to compliance, specifying a date by which you expect to complete this task.
ja: 調査がコンプライアンス課題を明らかにした場合には、照会者に対し、製品やサービスをコンプライアンス遵守の状態に戻すために必要な手順を全て実行することと、これらの作業を完了するのに予想される日程を明確にして、事実を伝えるべきです。

source: If the license changed, contact the OSRB to ensure that compliance records are updated and that the new license does not create a conflict.
ja: もしライセンスが変わっていたら、コンプライアンス記録を更新して、新しいライセンスが問題を起こさないように、OSRBに相談します。

source: If the product has a user-accessible file system, the copyright information should be included in the file system in a file containing, for instance, all the copyright notices for all open source used in the product.
ja: 製品が、ユーザーが利用可能なファイル システムを有している場合には、著作権情報は、例えば製品で利用されている全オープン ソースに対する全著作権表記は、ファイル システムに含まれているべきです。

source: If the source code package requires special build tools or environment, then include the details in a README file or similar.
ja: もし、ソース コード パッケージが、特別なビルド ツールや環境を必要とするならば、READMEファイル等にその詳細を記載します。

source: If the third-party software provider provides only binaries, not source code, then the product team and/or the software supplier manager who manages the relationship with the third-party software provider must obtain a confirmation (for instance, a scan report) that there is no open source in the provided software.
ja: もし、サード パーティ ソフトウェア プロバイダーが、ソースコード無しにバイナリだけを提供している場合には、製品チームと、そのサード パーティ ソフトウェア プロバイダーと連絡を取っているソフトウェア供給マネージャは、両方、またはどちらかが、（例えばスキャン報告などによって）提供されたソフトウェアにオープン ソースが含まれていないことを確認しなければなりません。

source: If the use case includes a graphical user interface, the end user should be able to view the copyright information from an ABOUT or a LICENSE screen.
ja: グラフィカル ユーザー インタフェースを有する場合には、エンド ユーザーは「製品について」や「ライセンス」の画面から著作権情報を参照することができるようにすべきです。

source: If there are issues to be resolved, then the compliance officer creates subtasks within the compliance tickets and assigns them to the appropriate engineers to be resolved.
ja: 解決すべき課題がある時には、コンプライアンス オフィサーは、コンプライアンス チケットにサブタスクを設定し、解決のために適切な技術者に担当を割り当てます。

source: If there are no issues, then the compliance office will move the compliance ticket forward to the legal review phase.
ja: 課題がないならば、コンプライアンス オフィサーは、コンプライアンス チケットを法務レビュー フェーズへと進めます。.

source: If there are no issues, then the compliance officer moves the ticket to the final stage in the approval process.
ja: 課題が無いならば、コンプライアンス オフィサーは、チケットを承認プロセスの最終段階へ送ります。

source: If there was a compliance issue, you should call for an OSRB meeting to discuss the case, learn how this non-compliance occurred, and improve existing process and practices to ensure that such errors do not happen again.
ja: コンプライアンス課題があった場合には、OSRBを招集して、事例を議論し、どのようにしてこのコンプライアンス違反が生じたかを学び、そのような誤りが再び生じないように、既存のプロセスとプラクティスを改善するべきです。

source: If there were no issues with the licensing, the legal counsel would then decide on the incoming and outgoing licenses of the software component, and would forward the compliance ticket into the compliance architectural phase.
ja: ライセンスに問題が無いならば、法務担当は、ソフトウェア コンポーネントに関して、入るライセンスと出るライセンスを決定し、コンプライアンス アーキテクチャー レビュー フェーズへコンプライアンス チケットを進めます。

source: If they identify a dependency resulting in a licensing conflict, the Compliance Officer will issue a ticket to Engineering to resolve the dependency problem by reworking the source code.
ja: もしライセンスの矛盾になるような依存関係を発見した場合、コンプライアンス オフィサーは、ソース コードの再作業によって依存関係問を題解決するためにチケットを技術担当に発行する。
